/* data1 1942-1972 분기별 미국 실업률 */
data unemployment;
  input yt @@;
  t=_n_;
lines;
3.73 3.67 3.77 3.83 4.67 5.87 6.70 6.97 6.40 5.57 4.63 4.23
3.50 3.10 3.17 3.37 3.07 2.97 3.23 2.83 2.70 2.57 2.73 3.70
5.27 5.80 5.97 5.33 4.73 4.40 4.10 4.23 4.03 4.20 4.13 4.13
3.93 4.10 4.23 4.93 6.30 7.37 7.33 6.37 5.83 5.10 5.27 5.60
5.13 5.23 5.53 6.27 6.80 7.00 6.77 6.20 5.63 5.53 5.57 5.53
5.77 5.73 5.50 5.57 5.47 5.20 5.00 5.00 4.90 4.67 4.37 4.10
3.87 3.80 3.77 3.70 3.77 3.83 3.83 3.93 3.73 3.57 3.53 3.43
3.37 3.43 3.60 3.60 4.17 4.80 5.17 5.87 5.93 5.97 5.97 5.97
5.83 5.77 5.53 5.30
;

symbol i=join;
proc gplot data=unemployment;
  plot yt*t;
run;
proc arima data=unemployment;
  identify var=yt;
run;

/* data2 1884-1939 영국 웨일즈 지방연간 보리생산량  */
data barley;
  input yt@@;
  year = _n_ + 1883;
lines;
15.2 16.9 15.3 14.9 15.7 15.1 16.7 16.3 16.5 13.3 16.5 15.0
15.9 15.5 16.9 16.4 14.9 14.5 16.6 15.1 14.6 16.0 16.8 16.8
15.5 17.3 15.5 15.5 14.2 15.8 15.7 14.1 14.8 14.4 15.6 13.9
14.7 14.3 14.0 14.5 15.4 15.3 16.0 16.4 17.2 17.8 14.4 15.0
16.0 16.8 16.9 16.6 16.2 14.0 18.1 17.5
;

symbol i=join;
proc gplot data=barley;
  plot yt*year;
run;
proc arima data=barley;
  identify var=yt;
run;


/* data3  지갑 소매치기 건수 */
data purse;
  input yt @@;
  t=_n_;
lines;
10 15 10 10 12 10 7 17 10 14
8 17 14 18 3 9 11 10 6 12
14 10 25 29 33 33 12 19 16 19
19 12 34 15 36 29 26 21 17 19
13 20 24 12 6 14 6 12 9 11
17 12 8 14 14 12 5 8 10 3
16 8 8 7 12 6 10 8 10 5
7
;
symbol i=join;
proc gplot data=purse;
  plot yt*t;
run;
proc arima data=purse;
  identify var=yt;
run;


/* data4  트럭 생산부품의 평균 불량품 수 */
data truck;
  input yt @@;
  t=_n_;
lines;
1.20 1.50 1.54 2.70 1.95 2.40 3.44 2.83 1.76 2.00 2.09 1.89 1.80
1.25 1.58 2.25 2.50 2.05 1.46 1.54 1.42 1.57 1.40 1.51 1.08 1.27
1.18 1.39 1.42 2.08 1.85 1.82 2.07 2.32 1.23 2.91 1.77 1.61 1.25
1.15 1.37 1.79 1.68 1.78 1.84
;

symbol i=join;
proc gplot data=truck;
  plot yt*t;
run;
proc arima data=truck;
  identify var=yt;
run;

